function changeLocation() {
    const placeDropdown = document.getElementById('place');
    const placeValue = placeDropdown.value;
    const locationDropdown = document.getElementById('location');
    while (locationDropdown.firstChild) {
        locationDropdown.removeChild(locationDropdown.firstChild);
    }
    let locationArray = [];
    if (placeValue === 'Област Кавала') {
        locationArray = ['Авли', 'Агиасма', 'Агиос Андреас', 'Акровуни', 'Акропотамос', 'Амигдалеонас', 'Амисиана',
            'Ано Лефки', 'Галипсос', 'Гравуна', 'Доматя', 'Ексохи', 'Елеохори', 'Елефтерес', 'Елефтеруполи',
            'Заркадя', 'Зигос', 'Каравагелис', 'Кариани', 'Керамоти', 'Кипя', 'Кокинохома', 'Кокинохори',
            'Кринидес', 'Крионери', 'Лефки', 'Лидиа', 'Лутра Елефтерон', 'Мелиса', 'Мелисиокомо',
            'Месоропи', 'Меся', 'Миртофито', 'Моностираки', 'Мустени', 'Неа Ираклица', 'Неа Карвали', 'Неа Каря',
            'Неа Перамос', 'Орфани', 'Орфани Паралия', 'Офринио', 'Палеохори', 'Пальо Чифлики (Пальо)',
            'Паралия Елеохори', 'Паралия Кариани', 'Паралия Миртофито', 'Паралия Офринио', 'Паралия Фоля',
            'Перни', 'Пигес', 'Пиргохори', 'Платанотопос', 'Подохори', 'Полистило', 'Сидирохори',
            'Филипи', 'Фоля', 'Хайдефето', 'Халкеро', 'Хрисокастро', 'Хрисохори', 'Хрисуполи'
        ];
    } else if (placeValue === 'Област Халкидики') {
        locationArray = ['Агия Параскеви', 'Агиос Мамас', 'Агиос Николаос', 'Агия Кариаки', 'Акти Азапико',
            'Акти Елиас', 'Акти Салоникю', 'Арнеа', 'Афитос', 'Вавдос', 'Ватопеди', 'Вурвуру', 'Елани', 'Елия Никитис', 'Йерисос',
            'Каламитси', 'Каландра', 'Каливес', 'Каликратия', 'Калитеа', 'Касандра', 'Касандрия',
            'Криарици', 'Криопиги', 'Лагомандра', 'Лутра', 'Метармофоси', 'Мола', 'Калива', 'Миконос', 'Мудания',
            'Неа Рода', 'Неа Скиони', 'Неа Триглия', 'Нео Фокеа', 'Неос Мармарас', 'Неохори', 'Никити', 'Олимпиада',
            'Олинтос', 'Ормос', 'Панагияс', 'Остров Амулиани', 'Палиури', 'Партенонас', 'Пефкохори',
            'Пиргадикия', 'Полигирос', 'Полийхроно', 'Полихроно',
            'Порто Куфо', 'Посиди', 'Потидеа', 'Псакудия', 'Сани', 'Сарти', 'Сивири', 'Сикия', 'Ситония', 'Спалатронисия',
            'Стратони', 'Таксиархис', 'Торони', 'Трипити', 'Урануполи',
            'Флогита', 'Фурка', 'Ханиоти', 'Херакини', 'Холомонтас'
        ];
    } else if (placeValue === 'Област Тасос') {
        locationArray = ['Агиос Георгиос', 'Алики', 'Астрида', 'Гликади', 'Глифада', 'Иера Мони',
            'Каливес', 'Каливиа', 'Калирахи', 'Кастро', 'Кинира', 'Лефки', 'Лимена', 'Лименаря',
            'Макриамос', 'Мариес', 'Мегалос Принос', 'Микрос Принос', 'Мони Архагелу', 'Ормос Принос', 'Палеохори',
            'Панагия', 'Потамиа', 'Потос', 'Принос', 'Рахони', 'Скала Калихарис',
            'Скала Марион', 'Скала Потамяс', 'Скала Рахони', 'Скала Сотирас', 'Сотирас',
            'Тасос (Център)', 'Теологос', 'Тимониа', 'Хриси Акти', 'Хриси Амудя'
        ];
    } else if (placeValue === 'Област Драма') {
        locationArray = ['Драма'];
    } else if (placeValue === 'Област Солун') {
        locationArray = ['Ано Ставрос', 'Аспровалта', 'Врасна', 'Милиес', 'Неа Врасна', 'Паралия Врасна',
            'Ривиера', 'Сериаки Акти', 'Ставрос'
        ];
    } else if (placeValue === 'Област Серес') {
        locationArray = ['Агий Анаргири', 'Агиос Антониос', 'Агиос Атанасиос', 'Агиос Йоанис', 'Агиос Никитас',
            'Агиос Пантелимонас', 'Амфиполи', 'Византио (Калкани)', 'Ептамили', 'Инуса',
            'Иония (Сфагия)', 'Каливиа', 'Каменикиа', 'Киупля', 'Лефконас', 'Македономахон',
            'Неа Кердилия', 'Нео Сули', 'Никеа', 'Омония', 'Палеокоми', 'Панорама - Калитеа',
            'Профитис Илияс- Агия София', 'Родоливос', 'Саранда Мартирес', 'Сирис (Сигис- Неа Кифися)', 'Таксиархес (Център)'
        ];
    }
    var firstOpt = document.createElement('option');
    firstOpt.innerHTML = '';
    locationDropdown.appendChild(firstOpt);
    for (var i = 0; i < locationArray.length; i += 1) {
        var option = document.createElement('option');
        option.innerHTML = locationArray[i];
        locationDropdown.appendChild(option);
    }
}
